{
    "articles":[
        {
            "title": "What to expect if the government shuts down",
            "author": "Francis Scialabba",
            "content": "There’s still time for a last-minute deal. But unless Republican House Speaker Kevin McCarthy can break his stalemate with right-wing members of his party to pass a new spending bill, the federal government will have to pack it up on October 1. Even if you’re not a park ranger or someone who relies on food assistance programs like WIC (which only has a few days of contingency funds available) the government furloughing workers and not giving out new cash will have far-reaching consequences that could impact you. Here are some of the disruptions to expect, if you’re a... Traveler: Because they are considered essential workers, TSA staffers will keep yelling at you to take your shoes off, and the people directing planes in towers won’t be sent home. But all hiring and training would pause, hampering the travel industry’s pandemic recovery. Oh, and national parks would probably stay open—but without bathrooms. Investor: Sorry if you wanted to plan a big IPO next week. The stock market itself wouldn’t have to close, but SEC Chair Gary Gensler said yesterday that a shutdown would reduce his department’s staff to about 7%, which could mean companies that haven’t already filed to go public would have to wait. Government contractor: Most federal employees usually receive back pay when the government starts up again, but millions of federal contractors likely won’t recoup the estimated $1.9 billion they stand to lose every day the government is closed, according to the president of the trade association that represents government contract workers. Big companies like Elon Musk’s SpaceX and pharma giants like Pfizer would probably bounce back quickly, though. The good (?) news…is that the IRS will probably be just fine, thanks to a funding boost from the Inflation Reduction Act, and the postal service will still deliver your bills. Big picture: Experts warn that the longer a shutdown lasts, the more losses spread. During the last shutdown, which went five weeks, the US economy lost $3 billion, according to the Congressional Budget Office.—MM"
        },
        {
            "title": "Tech Giants Lead Stock Gains Before Powell Speech: Markets Wrap",
            "author": "Cristin Flanagan and Cecile Gutscher",
            "content": "(Bloomberg) -- US stocks rebounded Thursday while Treasuries were mixed ahead of an afternoon speech from Federal Reserve Chair Jerome Powell. Tech behemoths, including Nvidia Corp., Meta Platforms Inc. and Tesla Inc., drove the Nasdaq 100 higher, shaking off a choppy morning session. Equities also got a boost from Ford Motor Co. and General Motors Co. after the United Auto Workers was said to dial back the wage increases the union was seeking for workers. Dovish-leaning comments from one policymaker and weak consumer spending data helped stoke hope for some easing of the Federal Reserve’s messaging ahead of Powell’s comments. September is still shaping up to be the worst month in 2023 for the US stock benchmarks after the central bank left interest rates at their highest in 22 years at its last meeting. Chicago Fed President Austan Goolsbee said policymakers were at risk of overshooting on interest rates by putting too much emphasis on the idea that steep job losses are needed to quell inflation. Personal consumption, the main driver of the US economy, rose an annualized 0.8% in the April-to-June period, the weakest advance in over a year. Other data showed GDP rose at an unrevised 2.1% rate during the period while weekly jobless claims came in lighter than estimates.“Many investors are revising their view around what the longer-run interest rate that is appropriate for the main western economies is,” Joseph Little, global chief strategist at HSBC Asset Management, said in an interview with Bloomberg Television. All the while in the stock market you have this combination of equity investors raising up expectations for 2024 profits,” he added. “It is the consensus view: rising bond yields, you have an equity market trading on higher multiples. It is getting worse and worse. Many challenges at this point. The selloff in US Treasuries cooled ahead of Powell’s speech. In the UK, benchmark government bond yields climbed as much as 20 basis points, the largest daily increase in almost a year on a closing basis. Global bonds are on track for the weakest since February. The rally in oil paused Thursday after WTI crude traded above $94 a barrel earlier in the week. The dollar and gold both slid."
        },
        {
            "title":"Occidental Petroleum Stock Shows Rising Price Performance With Jump To 81 RS Rating",
            "author": "Investor's Business Daily and Julie Mak",
            "content": "The Relative Strength (RS) Rating for Occidental Petroleum (OXY) stock entered a new percentile Thursday, with an increase from 75 to 81. When looking for the best stocks to buy and watch, one factor to watch closely is relative price strength. This proprietary rating measures market leadership by showing how a stock's price action over the last 52 weeks measures up against that of the other stocks in our database. Over 100 years of market history reveals that the best stocks often have an RS Rating north of 80 in the early stages of their moves. Occidental Petroleum stock is building a consolidation with a 76.11 entry. See if the stock can clear the breakout price in heavy trade. The oil & gas company reported negative growth for both the top and bottom lines last quarter. Occidental Petroleum stock holds the No. 9 rank among its peers in the Oil & Gas-International Exploration & Production industry group. Murphy Oil (MUR) and Ovintiv (OVV) are also among the group's highest-rated stocks."
        },
        {
            "title": "The stock market is showing cracks - and even the 'Magnificent 7' aren't safe from a recession, Morgan Stanley's stock chief warns",
            "author": "Theron Mohamed",
            "content": "The outlook for stocks is darkening as consumers run short of cash, and even the best-performing names could tumble if a recession hits, Morgan Stanley's stock chief has warned. 'We are seeing a breakdown again in a lot of the stock market,' Mike Wilson said on 'Bloomberg Surveillance' this week.'Some of these consumer stocks are really, really struggling,' he continued, attributing their woes to many consumers exhausting their pandemic savings, and the prospect of student-loan payments resuming in October. 'That's the wild card, that is the risk for the fourth quarter — can the consumer continue to surprise on the upside?' the investment bank's chief US equity strategist and chief investment officer asked. The S&P 500 has climbed 11% this year, largely thanks to big gains among the so-called Magnificent Seven stocks. For example, Nvidia, Meta, and Tesla shares are up 190%, 147%, and 95% respectively. Investors are betting the Federal Reserve, which has hiked interest rates from nearly zero to north of 5% over the past 18 months to cool historic inflation, will crush the threat without tipping the economy into recession. They may be proven wrong, Wilson cautioned. 'If you have a hard landing then even the big winners will feel that,' he said, underscoring the current uncertainty around whether a recession will set in or growth will rebound. 'This purgatory land is we're just gonna kind of slop back and forth and the market's going to continue to gravitate toward the lifeboats,' he said. Wilson pointed out the Fed is in the unusual position of not being able to cut rates ahead of the recession, as that could reignite inflation. 'We're just going to ride this until basically you run out of gas, and that could be another year, we don't know the answer to that yet,' he said. Regardless, the Wall Street veteran emphasized that investors should own stocks when inflation is high, as companies with pricing power can charge more to offset their higher costs and continue growing their profits. 'That is your protection against this new regime,' he said. Wilson struck a more pessimistic tone in another recent interview. He warned there was limited upside and material downside to buying the S&P 500 today, and cautioned that a shock to the system could send the index down 20% or more, from around 4,300 points today to the low 3,000s. 'The cracks are forming,' Wilson said. 'They're all over the place, which is why people are cramming into a handful of stocks'."
        }
    ]
}